Repository: Mulli/cpt-export
Catalog: languages/cpt-export-*.po
Languages: he_il

source: CPT Export requires PHP 7.4 or higher. You are running PHP %s.
he_il: תוסף CPT Export דורש PHP 7.4 או גרסה חדשה יותר. אתה מריץ PHP %s.

source: CPT Export: To use translations for your language (%1$s), please ensure .mo files are placed in %2$s or %3$s. A .pot file is available in the plugin's %4$s directory to create new translations.
he_il: CPT Export: כדי להשתמש בתרגומים עבור השפה שלך (%1$s), אנא ודא שקבצי .mo ממוקמים ב-%2$s או ב-%3$s. קובץ .pot זמין בתיקיית %4$s של התוסף ליצירת תרגומים חדשים.

source: CPT Export Tool
he_il: כלי ייצוא סוגי פוסטים מותאמים

source: CPT Export
he_il: ייצוא CPT

source: Form remembers your last settings
he_il: הטופס זוכר את ההגדרות האחרונות שלך

source: Fields below are pre-filled with your previous export settings.
he_il: השדות למטה מולאו מראש עם הגדרות הייצוא הקודמות שלך.

source: Reset to defaults
he_il: איפוס לברירת מחדל

source: Export Custom Post Types
he_il: ייצוא סוגי פוסטים מותאמים

source: When you click the button below WordPress will create an XML file for you to save to your computer.
he_il: כאשר תלחץ על הכפתור למטה, וורדפרס ייצור קובץ XML שתוכל לשמור למחשב שלך.

source: This format, which is called WordPress eXtended RSS or WXR, will contain your posts, custom fields, categories, and other content.
he_il: פורמט זה, הנקרא WordPress eXtended RSS או WXR, יכיל את הפוסטים, השדות המותאמים, הקטגוריות ותוכן נוסף שלך.

source: Choose what to export
he_il: בחר מה לייצא

source: Post Type
he_il: סוג פוסט

source: Select a post type...
he_il: בחר סוג פוסט...

source: Select the post type you want to export.
he_il: בחר את סוג הפוסט שברצונך לייצא.

source: Please select a post type to export.
he_il: אנא בחר סוג פוסט לייצוא.

source: Category
he_il: קטגוריה

source: All categories
he_il: כל הקטגוריות

source: Select a specific category to filter by. Options will update based on the selected post type.
he_il: בחר קטגוריה ספציפית לסינון. האפשרויות יתעדכנו בהתאם לסוג הפוסט שנבחר.

source: Loading categories...
he_il: טוען קטגוריות...

source: Author
he_il: מחבר

source: All authors
he_il: כל המחברים

source: Status
he_il: סטטוס

source: All statuses
he_il: כל הסטטוסים

source: Published
he_il: פורסם

source: Draft
he_il: טיוטה

source: Private
he_il: פרטי

source: Pending Review
he_il: ממתין לביקורת

source: Scheduled
he_il: מתוזמן

source: Date Range
he_il: טווח תאריכים

source: Start Date:
he_il: תאריך התחלה:

source: End Date:
he_il: תאריך סיום:

source: Leave blank to export all dates.
he_il: השאר ריק כדי לייצא את כל התאריכים.

source: Action
he_il: פעולה

source: Export Action
he_il: פעולת ייצוא

source: Move to Trash
he_il: העבר לפח

source: Delete Permanently (bypass trash)
he_il: מחק לצמיתות (עקוף פח)

source: Delete Media Permanently
he_il: מחק מדיה לצמיתות

source: Warning:
he_il: אזהרה:

source: Checking "Move to Trash" will move all exported posts to trash after export. If "Delete Permanently" is also checked, posts will bypass trash. If "Delete Media Permanently" is checked, attached media files will be permanently deleted (be careful if media is shared between posts). These actions cannot be undone!
he_il: סימון "העבר לפח" יעביר את כל הפוסטים המיוצאים לפח לאחר הייצוא. אם "מחק לצמיתות" מסומן גם כן, הפוסטים יעקפו את הפח. אם "מחק מדיה לצמיתות" מסומן, קבצי המדיה המצורפים יימחקו לצמיתות (היה זהיר אם המדיה משותפת בין פוסטים). פעולות אלה לא ניתנות לביטול!

source: Save in Folder
he_il: שמור בתיקייה

source: e.g., plfiles/stas/2022 or leave empty to download
he_il: למשל, plfiles/stas/2022 או השאר ריק להורדה

source: Optional: Enter folder path to save file in %s/[folder_path]/ instead of downloading. Supports subfolders (e.g., "plfiles/stas/2022"). Leave empty to download the file.
he_il: אופציונלי: הזן נתיב תיקייה לשמירת הקובץ ב-%s/[נתיב_תיקייה]/ במקום הורדה. תומך בתיקיות משנה (למשל, "plfiles/stas/2022"). השאר ריק להורדת הקובץ.

source: All subdirectories will be created automatically if they don't exist.
he_il: כל תיקיות המשנה ייווצרו אוטומטית אם הן לא קיימות.

source: File will be named: digma-[post_type]-[start_date]-[end_date].xml (or .zip)
he_il: הקובץ יקרא: digma-[סוג_פוסט]-[תאריך_התחלה]-[תאריך_סיום].xml (או .zip)

source: Compress File
he_il: דחוס קובץ

source: Compress export file (ZIP)
he_il: דחוס קובץ ייצוא (ZIP)

source: Creates a ZIP file containing the XML export. Useful for large exports or email attachments.
he_il: יוצר קובץ ZIP המכיל את ייצוא ה-XML. שימושי לייצואים גדולים או קבצים מצורפים לאימייל.

source: Download Export File
he_il: הורד קובץ ייצוא

source: Are you sure you want to reset all form fields to their default values?
he_il: האם אתה בטוח שברצונך לאפס את כל שדות הטופס לערכי ברירת המחדל?

source: Save
he_il: שמור

source: Download
he_il: הורד

source: and Permanently Delete Posts + Media
he_il: ומחק פוסטים + מדיה לצמיתות

source: and Permanently Delete Posts
he_il: ומחק פוסטים לצמיתות

source: and Move Posts to Trash + Delete Media
he_il: והעבר פוסטים לפח + מחק מדיה

source: and Move Posts to Trash
he_il: והעבר פוסטים לפח

source: Export File
he_il: ייצא קובץ

source: Confirm Permanent Deletion
he_il: אשר מחיקה לצמיתות

source: You are about to export and PERMANENTLY DELETE posts AND their media.\n\nThis action cannot be undone!\n\nAre you sure you want to proceed?
he_il: אתה עומד לייצא ולמחוק לצמיתות פוסטים והמדיה שלהם.\n\nפעולה זו לא ניתנת לביטול!\n\nהאם אתה בטוח שברצונך להמשיך?

source: You are about to export and PERMANENTLY DELETE posts.\n\nMedia will be preserved, but posts will be permanently deleted.\n\nThis action cannot be undone!\n\nAre you sure you want to proceed?
he_il: אתה עומד לייצא ולמחוק לצמיתות פוסטים.\n\nהמדיה תישמר, אבל הפוסטים יימחקו לצמיתות.\n\nפעולה זו לא ניתנת לביטול!\n\nהאם אתה בטוח שברצונך להמשיך?

source: Confirm Media Deletion
he_il: אשר מחיקת מדיה

source: You are about to export posts, move them to trash, and PERMANENTLY DELETE their media.\n\nPosts can be restored from trash, but media deletion cannot be undone!\n\nAre you sure you want to proceed?
he_il: אתה עומד לייצא פוסטים, להעביר אותם לפח, ולמחוק לצמיתות את המדיה שלהם.\n\nניתן לשחזר פוסטים מהפח, אבל מחיקת המדיה לא ניתנת לביטול!\n\nהאם אתה בטוח שברצונך להמשיך?

source: Confirm Move to Trash
he_il: אשר העברה לפח

source: You are about to export posts and MOVE them to trash.\n\nMedia will be preserved and posts can be restored from trash.\n\nDo you want to proceed?
he_il: אתה עומד לייצא פוסטים ולהעביר אותם לפח.\n\nהמדיה תישמר וניתן לשחזר פוסטים מהפח.\n\nהאם ברצונך להמשיך?

source: Security check failed: Invalid nonce.
he_il: בדיקת אבטחה נכשלה: nonce לא תקין.

source: You do not have sufficient permissions to export content.
he_il: אין לך הרשאות מספיקות לייצא תוכן.

source: You do not have sufficient permissions to delete content.
he_il: אין לך הרשאות מספיקות למחוק תוכן.

source: Error: Could not save file to the specified folder.
he_il: שגיאה: לא ניתן לשמור קובץ בתיקייה שצוינה.

source: No posts found matching your criteria.
he_il: לא נמצאו פוסטים התואמים לקריטריונים שלך.

source: Error: ZIP compression is not available on this server. ZipArchive extension is required.
he_il: שגיאה: דחיסת ZIP לא זמינה בשרת זה. נדרשת הרחבת ZipArchive.

source: Error: Could not create ZIP file. ZipArchive open error code: %d
he_il: שגיאה: לא ניתן ליצור קובץ ZIP. קוד שגיאת פתיחת ZipArchive: %d

source: Error: Could not add XML data to ZIP file.
he_il: שגיאה: לא ניתן להוסיף נתוני XML לקובץ ZIP.

source: Error: Could not finalize ZIP file.
he_il: שגיאה: לא ניתן לסיים את קובץ ה-ZIP.

source: Error: Could not read ZIP file content.
he_il: שגיאה: לא ניתן לקרוא את תוכן קובץ ה-ZIP.

source: You do not have permission to use this shortcode.
he_il: אין לך הרשאה להשתמש בקוד קצר זה.

source: Error: post_type parameter is required for the shortcode.
he_il: שגיאה: פרמטר post_type נדרש עבור הקוד הקצר.

source: Error: Post type "%s" does not exist.
he_il: שגיאה: סוג פוסט "%s" לא קיים.

source: You do not have permission to delete posts via this shortcode.
he_il: אין לך הרשאה למחוק פוסטים דרך הקוד הקצר הזה.

source: Successfully saved %1$s export (%2$d posts, %3$d attachments) to: %4$s
he_il: נשמר בהצלחה ייצוא %1$s (%2$d פוסטים, %3$d קבצים מצורפים) ב: %4$s

source: Error: Could not save file to the specified folder via shortcode.
he_il: שגיאה: לא ניתן לשמור קובץ בתיקייה שצוינה דרך הקוד הקצר.

source: ZIP data cannot be displayed directly. Use download or save_folder.
he_il: נתוני ZIP לא יכולים להיות מוצגים ישירות. השתמש בהורדה או save_folder.

source: Export ready (%1$d posts, %2$d attachments). Headers already sent, cannot download directly. File: %3$s
he_il: ייצוא מוכן (%1$d פוסטים, %2$d קבצים מצורפים). כותרות כבר נשלחו, לא ניתן להוריד ישירות. קובץ: %3$s

source: Please try exporting from the Tools > CPT Export page for direct download.
he_il: אנא נסה לייצא מעמוד כלים > ייצוא CPT להורדה ישירה.

source: and posts/media permanently deleted
he_il: ופוסטים/מדיה נמחקו לצמיתות

source: and posts moved to trash
he_il: ופוסטים הועברו לפח

source: /media also permanently deleted
he_il: /מדיה גם נמחקה לצמיתות

source: /media also permanently deleted (even if posts only trashed)
he_il: /מדיה גם נמחקה לצמיתות (גם אם פוסטים רק הועברו לפח)

source: Export processed for %1$d posts and %2$d attachments. %3$s No download or save action specified.
he_il: ייצוא עובד עבור %1$d פוסטים ו-%2$d קבצים מצורפים. %3$s לא צוינה פעולת הורדה או שמירה.

source: Export Successful!
he_il: ייצוא הצליח!

source: Successfully exported %d posts.
he_il: יוצאו בהצלחה %d פוסטים.

source: Compressed file saved to: %s
he_il: קובץ דחוס נשמר ב: %s

source: File saved to: %s
he_il: קובץ נשמר ב: %s

source: Download File
he_il: הורד קובץ

source: Export Error:
he_il: שגיאת ייצוא:
